# -*- coding: utf-8 -*-

"""
function_01.py
"""

# 함수(Function) / 메소드(Method)
# - 기능을 정의하는 단위
# - 코드의 재활용을 위해서 사용되는 문법
# - 프로그램을 구현하는 도중 반복되는 실행 코드의
#   묶음을 함수로 정의하여 재활용할 수 있음

# 함수/메소드의 선언 방법
# def 함수명( [매개변수] ) :
#   함수가 호출되었을때, 실행할 실행문
#   ...

# hello 함수의 정의
def hello() :
    print("hello 함수 실행~!")

# 함수 내부에 정의되어 있는 실행 코드들은
# 해당 함수가 호출되기 전까지 실행되지 않습니다.

# 함수의 내용을 실행하기 위해서는
# 해당 함수를 호출해야 합니다.

# 함수의 호출방법
# 함수명([해당 함수의 실행에 필요한 매개변수...])
hello()

# 함수는 선언된 이후 계속해서 호출될 수 있습니다.
hello()
hello()














